# Id Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetPreview..::..Id Property
WorksetPreview Class See Also
---
Id of the workset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public WorksetId Id { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Id As WorksetId
	Get
```

Visual C++
---
```text
public:
property WorksetId^ Id {
	WorksetId^ get ();
}
```

# Remarks
Id of the workset may be changed while synchronizing with central. Please use UniqueId to reliably identify worksets despite changes which occur due to synchronization with central.
# See Also
WorksetPreview Class
Autodesk.Revit.DB Namespace